#+BEGIN_COMMENT
.. title: 在 Geforce 1080 上搭建 TensorFlow GPU 版本
.. slug: zai-geforce-1080-shang-da-jian-tensorflow-gpu-ban-ben
.. date: 2016-11-10 17:39:02 UTC+08:00
.. tags: 
.. category: 
.. link: 
.. description: 
.. type: text
#+END_COMMENT
----------

#+BEGIN_HTML
<!-- TEASER_END --> 
#+END_HTML
*** 而 name_scope 不一定改变 Variable 的名字
  - 用 tf.Variable 创建 variable 前面会加上 name_scope 也就是所有的scope
  - 用 tf.get_variable 创建 variable 前面只会加上 variable_scope
  
#+BEGIN_SRC python :results output
  import tensorflow as tf
  with tf.variable_scope("foo"):
      with tf.name_scope("bar"):
          v = tf.get_variable("v", [1])
          v1 = tf.Variable(tf.zeros([1]), name = "v1")
          x = 1.0 + v
  print("v  =",v.name)
  print("v1 =",v1.name)
  print("op =",x.op.name)
  # assert v.name == "foo/v:0"
  # assert x.op.name == "foo/bar/add"
#+END_SRC

#+RESULTS:
: v  = foo/v:0
: v1 = foo/bar/v1:0
: op = foo/bar/add
